

* TODO priv [2/16]
  - State "TODO"       from "TODO"       [2016-10-19 周三 09:00]
她喜欢我
还有时间
我能反杀
一直想飞到西安然后坐火车去敦煌

** TODO [#A] VICTORY LOVES PREPARATION
   DEADLINE: <2016-10-19 周三>
   - State "TODO"       from ""           [2016-10-19 周三 10:33]
** TODO 柳铁老校区，吃好多好吃的
** TODO 我没有口红
   - State "TODO"       from ""           [2016-10-23 周日 12:03]
** TODO 下载<<六弄咖啡馆>>
   - State "TODO"       from "DONE"       [2016-10-19 周三 09:01]
   :PROPERTIES:
   :movie:    must download
   :END:
** TODO <<我可以咬你一口吗>>
   - State "TODO"       from ""           [2016-10-20 周四 21:10]
** TODO <<你今天真好看>>
   - State "TODO"       from ""           [2016-10-23 周日 12:04]
** TODO <<憨豆都追女仔>>
   - State "TODO"       from ""           [2016-10-23 周日 12:06]
** TODO 同步表情
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
** TODO LKM
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
** TODO PYTHON 那个模块
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
关键字 ddos 阿里养鸡 arm地址
** TODO irc channel 做中转
   - State "TODO"       from "TODO"       [2016-10-19 周三 08:59]
** TODO tor做中转
   - State "TODO"       from ""           [2016-10-26 周三 22:51]
** TODO XJJ
   - State "TODO"       from ""           [2016-10-19 周三 15:19]
*** server
**** DONE C&C address release
     CLOSED: [2016-10-19 周三 15:21]
     - State "DONE"       from ""           [2016-10-19 周三 15:21]
     - curl http://my.csdn.net/echofocus | grep wassup
**** DONE C&C address bind and listen
     CLOSED: [2016-10-20 周四 13:35]
     - State "DONE"       from "TODO"       [2016-10-20 周四 13:35]
     - State "TODO"       from ""           [2016-10-19 周三 15:21]
     - C programming
**** DONE 执行 cd 之后无效 模仿一下 netcat 用 select
     CLOSED: [2016-10-20 周四 17:12]
     - State "DONE"       from "TODO"       [2016-10-20 周四 17:12]
     - State "TODO"       from ""           [2016-10-20 周四 13:35]
*** client
**** DONE read C&C address
     CLOSED: [2016-10-19 周三 23:39]
     - State "DONE"       from "TODO"       [2016-10-19 周三 23:39]
     - State "TODO"       from ""           [2016-10-19 周三 15:37]
**** DONE create channel
     CLOSED: [2016-10-20 周四 12:32]
     - State "DONE"       from "TODO"       [2016-10-20 周四 12:32]
     - State "TODO"       from ""           [2016-10-19 周三 15:37]

**** DONE 整理 create channel 的代码
     CLOSED: [2016-10-20 周四 14:07]
     - State "DONE"       from "TODO"       [2016-10-20 周四 14:07]
     - State "TODO"       from ""           [2016-10-20 周四 13:35]

*** rootkit
    - State "TODO"       from ""           [2016-10-20 周四 17:12]
**** DONE 看感染的例子
     CLOSED: [2016-10-23 周日 12:08]
     - State "DONE"       from "TODO"       [2016-10-23 周日 12:08]
     - State "TODO"       from "TODO"       [2016-10-23 周日 12:08]
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
**** DONE 例子运行起来
     CLOSED: [2016-10-23 周日 12:08]
     - State "DONE"       from "TODO"       [2016-10-23 周日 12:08]
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
**** DONE 成功用 suterusu 感染
     CLOSED: [2016-10-24 周一 12:19]
     - State "DONE"       from "TODO"       [2016-10-24 周一 12:19]
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
**** DONE 增加 suterusu 的功能 [2/2]
     CLOSED: [2016-10-21 周五 16:34]
     - State "DONE"       from "TODO"       [2016-10-21 周五 16:34]
     - State "TODO"       from ""           [2016-10-20 周四 21:41]
     - [X] run file after hide it
     - [X] find port and pid and hide it
**** TODO 取消 hide_port hide_pid 查看稳定性
     - State "TODO"       from ""           [2016-10-23 周日 12:09]
**** TODO release
     - State "TODO"       from ""           [2016-10-23 周日 12:09]
** TODO 加密解密算法
   - State "TODO"       from ""           [2016-10-20 周四 18:
   - 应该用勒索程序将RSA加密后的密文
     发送到私有的服务端A
     A再通过后台直接查询比特币交易平台B
     B返回的结果
     A判断为收到钱了
     在A上用私钥进行解密
     然后将明文AES密钥和IV返回给勒索程序。
   - 使用AES加密算法去加密系统中的文件
     然后使用RSA加密算法去加密AES密钥
     虽然AES是对称加密算法
     但RSA为非对称加密算法
     只有拥有RSA私钥才能解密得到AES的密钥进而对被加密的文件进行解密
     软件加密时使用的AES密钥是随机生成的
     因此在加密过后无法复现密钥
*** DONE MD5
    CLOSED: [2016-10-26 周三 20:10]
    - State "DONE"       from "TODO"       [2016-10-26 周三 20:10]
    - State "TODO"       from ""           [2016-10-26 周三 09:45]
      output -> 128bits -> 32 in hex
      input -> break into 512-bit blocks (sixteen 32-bit words)
      input -> padded -> divisible by 512
      input -> padded -> one 1 -> many 0 -> 64 bits fewer than a multiple of 512
      ^?
      input -> padded -> remaining bits filled up with 64 bits representing the length of the original message, modulo 2^64
      process -> on 32-bit A B C D
*** TODO 使用AES加密算法去加密文件
    - State "TODO"       from ""           [2016-10-26 周三 22:41]
*** TODO 使用RSA加密AES密钥
    - State "TODO"       from ""           [2016-10-26 周三 22:41]
** DONE 转换添加 mid 到看代码的列表里
   - State "DONE"       from "DONE"       [2016-10-19 周三 09:00]
** DONE 上传 tabbar-tweak.el
   - State "DONE"       from "DONE"       [2016-10-19 周三 09:00]
   

* learn_table

| student | math | pyh | mean | pi number |
|---------+------+-----+------+-----------|
| b       |   13 |  09 |   11 |         5 |
| h       |   15 |  14 | 14.5 |         7 |
| a       |   17 |  13 |   15 |         9 |
#+TBLFM: $4=vmean($2..$3)
#+TBLFM: $5='(substring (number-to-string $pi) (round(string-to-number $4)) (+ 1 (round (string-to-number $4))));    
#+CONSTANTS: pi=3.1415926535897932384666666666666

| id |              r/g |              b/g |            gb/gr |   distance |
|----+------------------+------------------+------------------+------------|
|    | 540.602836879433 | 708.265957446809 | 1028.49290780142 |  1771.8880 |
|  1 |         0.560547 |         0.629883 |         1.000977 | 0.10865988 |
|  2 |         0.571289 |         0.642578 |         1.004883 | 0.10854316 |
|  7 |         0.574219 |         0.637695 |                1 | 0.11745107 |
#+TBLFM: $5=(((($2*1024/@2$2)-1)^2+(($3*1024/@2$3)-1)^2+(($4*1024/@2$4)-1)^2)^0.5)

* temporary [9/10]
  SCHEDULED: <2016-10-19 周三>
** TODO 下载歌曲 [0/16]
   DEADLINE: <2016-10-26 周三>
   - State "TODO"       from ""           [2016-10-26 周三 09:36]
   - [ ] 寂寞的鸭子
   - [ ] 忘不了
   - [ ] 为你我受冷风吹
   - [ ] 姐姐妹妹站起来
   - [ ] 黄昏
   - [ ] 你知道不知道
   - [ ] 蓝色雨（温岚）
   - [ ] 启程
   - [ ] 相爱十年 邓超，董洁 爱的箴言
   - [ ] 圣诞结
   - [ ] 演员
   - [ ] 后来
   - [ ] 搁浅
   - [ ] 吉米来吧

   - [ ] 你是我心内的一首歌
   - [ ] 丹顶鹤的故事

** DONE 同步.emacs
   CLOSED: [2016-10-19 周三 10:29]
   - State "DONE"       from "TODO"       [2016-10-19 周三 10:29]
   :PROPERTIES:
   :Effort:   0:00
   :END:
** DONE qyh_repo_rollback.sh [init|reset] [5/5]
 - [X] 列举相关的仓
   $w/kernel
   $w1
   $w1sdk
   $w2
 - [X] check arguments
 - [X] check $w
 - [X] reset 到 init
 - [X] sync 到 target
** DONE 擦白版
** DONE excel
 - [X] 计算公式（快捷键）
 - [X] 最大值
 - [X] 数据 -> 变化图
** DONE expand-region以及其他插件
** DONE 注释
** DONE 移动行
** DONE 问石梦云win7的主题
 - 搜狗的“图标整理器”
** DONE mtp驱动
